Autodesk.Revit.DB.Architecture.RailAngledJoinOption
The angled joins of the rails.
Since:
2013

Autodesk.Revit.DB.Architecture.RailAngledJoinOption.NoConnector
No connector.

Autodesk.Revit.DB.Architecture.RailAngledJoinOption.AddVerticalOrHorizontalSegments
Add vertical or horizontal segments.